// Створіть умову, яка буде завжди виконуватися. В тілі умови виводьте повідомлення "Привіт!".

if(true){
	alert('Привіт!')
}

// Подивіться на годинник і запишіть у змінну m кількість хвилин.
// В залежності від цього значення виведіть в консоль одне з повідомленнь:
// Перша половина години
// Друга половина години
// Змініть m так, щоб вивести інше повідомлення.

let m = 41;

if(m<30){
	console.log('Перша половина години');
}
else{
	console.log('Друга половина години');
}

// В корзині n яблук. Виведіть повідомлення, якщо корзина буде порожньою:
// Нажаль, корзина порожня.
// Умова повинна бути якнайкоротша.

let n = 0;

if(!n){
	console.log('На жаль, корзина порожня.');
}

// Тернарним оператором виведіть на екран одне з двох повідомлень:
// Корзина порожня.
// Корзина не порожня.
// Тут і надалі міняйте змінну так, щоб протестувати всі варіанти.

let apple = 3;

console.log( apple ? 'Корзина не порожня' : 'Корзина порожня');

// Виведіть на екран повідомлення, якщо в корзині від двох до п'яти яблук:
// В корзині декілька яблук

if(apple>=2&&apple<=5){
	console.log('В корзині декілька яблук');
}

// Виведіть на екран повідомлення, якщо це правда:
// Кількість яблук в корзині ділиться на 3 чи на 7.

if(apple%3===0||apple%7===0){
	console.log('Кількість яблук в корзині ділиться на 3 чи на 7.');
}

